In [1]:
import pandas as pd
import numpy as np

In [2]:
# seriler aslında numpy dizisine çok benzer. indexleme vs var. tek boyutludur array gibi.
bsozluk = {"atil":50,"zeynep":40,"mehmet":30}
pd.Series(bsozluk) # keyleri indexleme için kullanılır valueler ise veri olarak kullanılacak.

atil      50
zeynep    40
mehmet    30
dtype: int64

In [3]:
type(pd.Series(bsozluk))

pandas.core.series.Series

In [4]:
benimlistem = [50,40,30]
benimisimlerim = ["atil","zeynep","mehmet"]

In [5]:
pd.Series(data=benimisimlerim,index=benimlistem) # verileri ve indexleme elemanlarını ayrı ayrı verebiliriz.
# default olarak önce data sonra index elemamnları verilir.

50      atil
40    zeynep
30    mehmet
dtype: object

In [8]:
array1 = np.array([30,40,50])

In [13]:
pd.Series(data=array1,index=benimisimlerim) # eğer data'nın eleman sayısı indexten fazla olursa hata alırız ama index fazla olursa sorun yok. açıkta kalan olabilir.

atil      30
zeynep    40
mehmet    50
dtype: int32

In [14]:
pd.Series(["atil","zeynep","mehmet"],[1,2,3]) #

1      atil
2    zeynep
3    mehmet
dtype: object

In [18]:
yarismasonucu1 = pd.Series([10,15,20],["atil","zeynep","mehmet"])

In [19]:
yarismasonucu2 = pd.Series([15,21,10],["atil","zeynep","mehmet"]) # birebir aynı indexleme kullandık. burası önemli.

In [20]:
yarismasonucu2["mehmet"] # mehmetin datasını alırız.

10

In [21]:
sonsonuc = yarismasonucu1 + yarismasonucu2 # indexlere göre aynı olanları toplayacak.  eğer fazlan ya da eksik olsa index o zaman kesişimi olmayanlara NaN verecek. kesişimi olanlara toplama getirecek. 
sonsonuc

atil      25
zeynep    36
mehmet    30
dtype: int64

In [22]:
A = pd.Series([1,2,3,4,5],["a","b","c","d","e"])

In [23]:
B = pd.Series([1,2,3,4,5],["t","h","c","d","l"])

In [24]:
A + B # kesişimi olanlara toplama olacak olmayanlara ise NaN gelecek ayrı ayrı.

a    NaN
b    NaN
c    6.0
d    8.0
e    NaN
h    NaN
l    NaN
t    NaN
dtype: float64

# DATAFRAME

In [ ]:
# aslında serilerin birleşmiş halidir. çift boyutludur. satır ve sutun indexlemesi vardır.

In [25]:
data1 = np.random.randint(1,10,25).reshape(5,5)

In [26]:
data1

array([[6, 4, 1, 6, 4],
       [7, 2, 8, 5, 4],
       [9, 5, 6, 4, 1],
       [8, 3, 9, 9, 1],
       [2, 1, 2, 9, 3]])

In [29]:
dataframe1 = pd.DataFrame(data1,columns=[11,12,13,14,15],index=["a","b","c","d","e"]) # satır ve sutun indexlemesi yapabiliriz
dataframe1
#pd.DataFrame() ile oluştururuuz.  veriyi verir sonra ise ayarlama yapabiliriz.

   11  12  13  14  15
a   6   4   1   6   4
b   7   2   8   5   4
c   9   5   6   4   1
d   8   3   9   9   1
e   2   1   2   9   3

In [30]:
dataframe1[11]  # dataframe[sutun][satir]   dataframe.loc[satır][sutun]   bu şekilde gider.   tek sutun çağırırsak eğer bir seri gelir bize. birden fazla sutunda çağırabiliriz.

a    6
b    7
c    9
d    8
e    2
Name: 11, dtype: int32

In [33]:
dataframe1.loc["a"] # böyle ise satırı getirdik. sutun indexlemesi ile

pandas.core.series.Series

In [34]:
type(dataframe1.loc["a"]) # bir satırı çeker alırsakta aslında bir seri elde ederiz.    dataframeler yan yana veya alt alta tek boyutlu serilerim birleşmesi ile elde edilmiş çift boyutlu bir yapıdır.

pandas.core.series.Series

In [37]:
# .iloc ile biz .iloc[satır] ile index numarası kullanarak işlem yapabiliriz isim vs yazmaya gerek yok
dataframe1.iloc[0,1] # ilk satırın ikinci değerinii getirdi.   .iloc[0] yapsa idik ilk satırı bir seri halinde getirirdi.

4

In [38]:
dataframe1[16] = [1,2,3,4,5] # kolon indexi verip atama yaparsak eğer yeni bir sutun eklemiş oluruz.
dataframe1 # yeni bir sutun eklenmiş oldu.

   11  12  13  14  15  16
a   6   4   1   6   4   1
b   7   2   8   5   4   2
c   9   5   6   4   1   3
d   8   3   9   9   1   4
e   2   1   2   9   3   5

In [92]:
dataframe1.drop(16,axis=1,inplace=True) # axis 1 ile sutun deriz 16 ile yani isim ile hangisi düşürülecek bunu belirleriz. inplace True ile kalıcı değişim yaparız eğer bunu koymazsak bu yapı droplanmış hali return eder ama dataframe1'de değişim olmaz. kalıcı olması için inplace = True kullanmak lazım

KeyError: '[16] not found in axis'

In [43]:
dataframe1

   11  12  13  14  15
a   6   4   1   6   4
b   7   2   8   5   4
c   9   5   6   4   1
d   8   3   9   9   1
e   2   1   2   9   3

In [ ]:
dataframe1.loc["a",13] # bununla a satırının 13 nolu sutunundaki değeri alabiliriz.  veya.   dataframe1.loc["a",13]' te yapabiliriz numpydeki gibi.

In [48]:
a = dataframe1 < 5
a  # True False yapısı elde ederiz... eğer bir veri 5'ten küçükse True alır değilse False alır.

      11     12     13     14    15
a  False   True   True  False  True
b  False   True  False  False  True
c  False  False  False   True  True
d  False   True  False  False  True
e   True   True   True  False  True

In [50]:
dataframe1[a] # böylece True olanları görürüz. aynı satır ve sutun indexlemesine karşılık gelecek şekilde. yani üst üste koyulur true olanlar açılır False oolanlar NaN alır.

    11   12   13   14  15
a  NaN  4.0  1.0  NaN   4
b  NaN  2.0  NaN  NaN   4
c  NaN  NaN  NaN  4.0   1
d  NaN  3.0  NaN  NaN   1
e  2.0  1.0  2.0  NaN   3

In [53]:
b = dataframe1[dataframe1 < 3]
b.dropna(how = "all",axis = 1,inplace=True) # eğer sutunun hepsi 3Ten küçükse o sutunu sil demek. inplace True ile kalıcı hale getiririz.
b

    11   12   13   15
a  NaN  NaN  1.0  NaN
b  NaN  2.0  NaN  NaN
c  NaN  NaN  NaN  1.0
d  NaN  NaN  NaN  1.0
e  2.0  1.0  2.0  NaN

In [58]:
dataframe1[dataframe1[11] > 5] #11 nolu sutundaki True olanlar geleecek eğer 11'de bir satırın değeri 5'ten küçükse o zaman komple o satır gelmeyecek.

   11  12  13  14  15
a   6   4   1   6   4
b   7   2   8   5   4
c   9   5   6   4   1
d   8   3   9   9   1

In [59]:
dataframe1.reset_index() # index diye bir sutun oluşturur ve satır indexlerinin buraya atar. sonra satır indexlemesini 0 1 2 3... diye bilgisayar indexlemesi kullanarak yapar. kalıcı değişim olsun istersek o zaman inplace = True kullanmamız gerekir.

  index  11  12  13  14  15
0     a   6   4   1   6   4
1     b   7   2   8   5   4
2     c   9   5   6   4   1
3     d   8   3   9   9   1
4     e   2   1   2   9   3

In [62]:
liste1 = ["A","B","C","D","E"] # hazır bir liste olmalı elde indexlemeleri değiştirmek için.
dataframe1["yeni index"] = liste1  #komple satır indexlemesini değiştirmek istersek eğer
dataframe1.set_index("yeni index",inplace=True) # aslında yeni bir sutun ekleyip sonrasında ise o sutunu indexleme için kullandık.
dataframe1 # inplace = True ile ise kalıcı değişim sağlarız.

            11  12  13  14  15
yeni index
A            6   4   1   6   4
B            7   2   8   5   4
C            9   5   6   4   1
D            8   3   9   9   1
E            2   1   2   9   3

## multiindex

In [64]:
ilkindexler = ["simpson","simpson","simpson","south park","south park","south park"]
icindexler = ["homer","bart","marge","cartman","kenny","kyle"]
birlesmisindex = list(zip(ilkindexler,icindexler))
birlesmisindex

[('simpson', 'homer'),
 ('simpson', 'bart'),
 ('simpson', 'marge'),
 ('south park', 'cartman'),
 ('south park', 'kenny'),
 ('south park', 'kyle')]

In [65]:
birlesmisindex = pd.MultiIndex.from_tuples(birlesmisindex)

In [66]:
birlesmisindex

MultiIndex([(   'simpson',   'homer'),
            (   'simpson',    'bart'),
            (   'simpson',   'marge'),
            ('south park', 'cartman'),
            ('south park',   'kenny'),
            ('south park',    'kyle')],
           )

In [67]:
benimcizgifilmlistem = [[40,"a"],[30,"b"],[25,"c"],[15,"d"],[11,"e"],[12,"f"]]
cizgifilmnumpy = np.array(benimcizgifilmlistem)

In [68]:
cizgifilmdataframe = pd.DataFrame(data=cizgifilmnumpy,columns=["yas","meslek"],index=birlesmisindex)
cizgifilmdataframe

                   yas meslek
simpson    homer    40      a
           bart     30      b
           marge    25      c
south park cartman  15      d
           kenny    11      e
           kyle     12      f

In [69]:
cizgifilmdataframe.loc["simpson"]

      yas meslek
homer  40      a
bart   30      b
marge  25      c

In [70]:
cizgifilmdataframe.loc["south park"].loc["kenny"]

yas       11
meslek     e
Name: kenny, dtype: object

In [73]:
cizgifilmdataframe.index.names = ["film adi","isim"]
cizgifilmdataframe

                   yas meslek
film adi   isim
simpson    homer    40      a
           bart     30      b
           marge    25      c
south park cartman  15      d
           kenny    11      e
           kyle     12      f

# EKSİK VERİLER

In [74]:
import pandas as pd
import numpy as np

In [76]:
sozluk = {"istanbul":[30,29,np.NaN],"ankara":[20,np.NaN,25],"izmir":[40,39,38]} # NaN veri np.NaN ile oluşabilir.
havadurumu = pd.DataFrame(sozluk)
havadurumu

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [77]:
havadurumu.dropna(how = "any",axis = 1) # axis = 1 olacak ve sutunu yok edecek any dediğimiz için bir tane bile nan olursa yok eder sutunu. axis = 1 demezsek eğer o zaman default olarak 0 olur satırı siker atar.

   izmir
0     40
1     39
2     38

In [79]:
yeniveri = {"istanbul":[30,29,np.NaN],"ankara":[20,np.NaN,25],"izmir":[40,39,38],"antalya":[45,np.NaN,np.NaN]}
yenidt = pd.DataFrame(yeniveri)
yenidt

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [87]:
yenidt.dropna(axis = 1,thresh=2) # thresh = 2 demek eğer iki tane nan olmayan varsa elleme demek. 2 tane veri varsa elleme. daha az ise sil sutunu çünkü axis = 1

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [88]:
yenidt.dropna(axis = 1,thresh=3) # 3 tane nan olmayan varsa elleme 3Ten az nan olmayan varsa sil demek

   izmir
0     40
1     39
2     38

In [90]:
yenidt.fillna(20) # NaN olanlar 20 olacak. fillna ile nan verileri doldururuz.

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

# gruplandırmak(groupby)

In [94]:
maassozlugu = {"departman":["yazilim","satis","pazarlama","finans","hukuk","hukuk"],
"calisan ismi":["ahmet","mehmet","atil","burak","zeynep","fatma"] ,
               "maas":[300,400,500,600,700,800]
              }
dt1 = pd.DataFrame(maassozlugu)
dt1

   departman calisan ismi  maas
0    yazilim        ahmet   300
1      satis       mehmet   400
2  pazarlama         atil   500
3     finans        burak   600
4      hukuk       zeynep   700
5      hukuk        fatma   800

In [101]:
obje = dt1.groupby("departman")
obje.count() # kaç tane eleman var departmanlarda görebiliriz.

           calisan ismi  maas
departman
finans                1     1
hukuk                 2     2
pazarlama             1     1
satis                 1     1
yazilim               1     1

In [103]:
obje["maas"].mean() # ortalama maasları görebildik.

departman
finans       600.0
hukuk        750.0
pazarlama    500.0
satis        400.0
yazilim      300.0
Name: maas, dtype: float64

In [105]:
obje.describe()

           maas
          count   mean        std    min    25%    50%    75%    max
departman
finans      1.0  600.0        NaN  600.0  600.0  600.0  600.0  600.0
hukuk       2.0  750.0  70.710678  700.0  725.0  750.0  775.0  800.0
pazarlama   1.0  500.0        NaN  500.0  500.0  500.0  500.0  500.0
satis       1.0  400.0        NaN  400.0  400.0  400.0  400.0  400.0
yazilim     1.0  300.0        NaN  300.0  300.0  300.0  300.0  300.0

## CONCAT

In [108]:
sozluk1 = {"isim":["ahmet","mehmet","zeynep","atil"]
          ,
         "spor":["kosu","yuzme","kosu","basketbol"],
          "kalori":[100,200,100,100]}
data11 = pd.DataFrame(sozluk1,index=[0,1,2,3])
sozluk2 = {"isim":["osman","atlas","levent","fatma"]
          ,
         "spor":["kosu","yuzme","kosu","basketbol"],
          "kalori":[100,200,100,100]}
data12 = pd.DataFrame(sozluk2,index = [4,5,6,7])
sozluk3 = {"isim":["ayse","mahmut","duygu","nur"]
          ,
         "spor":["kosu","yuzme","badminton","tenis"],
          "kalori":[100,200,100,100]}
data13 = pd.DataFrame(sozluk2,index = [8,9,10,11])

In [110]:
pd.concat([data11,data12,data13]) # bir liste içerisinde dataFrameleri vereceğiz. axis = 1 dersek eğer o zaman satır indexlemesine göre dataframeleri yan yana koyar... ve eğer axis belirtmezsek axis = 0 kabul edilir dataframeler alt alta dizilir. sutuna göre.

      isim       spor  kalori
0    ahmet       kosu     100
1   mehmet      yuzme     200
2   zeynep       kosu     100
3     atil  basketbol     100
4    osman       kosu     100
5    atlas      yuzme     200
6   levent       kosu     100
7    fatma  basketbol     100
8    osman       kosu     100
9    atlas      yuzme     200
10  levent       kosu     100
11   fatma  basketbol     100

## MERGE

In [111]:
sozluk11 = {"isim":["ahmet","mehmet","zeynep","atil"]
          ,
         "spor":["kosu","yuzme","kosu","basketbol"]}
mergedataframe = pd.DataFrame(sozluk11)
sozluk22 = {"isim":["ahmet","mehmet","zeynep","atil"]
          ,
         "kalori":[100,200,100,100]}
mergedataframe2 = pd.DataFrame(sozluk22)

In [113]:
pd.merge(mergedataframe,mergedataframe2,on = "isim") # on ile hangi kolon üzerinden birleşme yapacağız belirleriz.  ortak nokta seçeriz ona göre birleşme olacak. iki tane dataframe varken teke düşürür.

     isim       spor  kalori
0   ahmet       kosu     100
1  mehmet      yuzme     200
2  zeynep       kosu     100
3    atil  basketbol     100

## PANDAS İLERİ OPERASYONLAR

In [114]:
maassozluk = {"isim":["ahmet","mehmet","zeynep","atil"]
          ,
         "departman":["yazilim","satis","pazarlama","yazilim"],
             "maas":[200,300,400,500]}
dt11 = pd.DataFrame(maassozluk)
dt11

     isim  departman  maas
0   ahmet    yazilim   200
1  mehmet      satis   300
2  zeynep  pazarlama   400
3    atil    yazilim   500

In [116]:
dt11["departman"].unique() # uniqe olanlaro gelir. tek taneye düşür hepsini öyle gelir

array(['yazilim', 'satis', 'pazarlama'], dtype=object)

In [117]:
dt11["departman"].nunique() # kaç adet farklı departman var görebiliriz.

3

In [119]:
dt11["departman"].value_counts() # tek tek kaç tane eleman var departmanlarda görebiliriz.

departman
yazilim      2
satis        1
pazarlama    1
Name: count, dtype: int64

In [125]:
def bruttennete(maas):
    return maas * 0.66
dt11["maas"] =  dt11["maas"].apply(bruttennete)  # her değer tek tek bu fonksiyona gider. kalıcı değişim oldu böylece.   atama yaptık.

In [126]:
dt11

     isim  departman   maas
0   ahmet    yazilim  132.0
1  mehmet      satis  198.0
2  zeynep  pazarlama  264.0
3    atil    yazilim  330.0

In [127]:
dt11.isnull() # eğer bir veri NaN ise True verir. Değilse False verir.

    isim  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [131]:
# PİVOT İŞLEMLERİ
yenibirveri = {
    "karakter sinifi":["south park","south park","simpson","simpson","simpson"],
    "karakter ismi":["cartman","kenny","homer","bart","bart"],
    "karakter yas":[9,10,50,20,10]
}
karakterdf = pd.DataFrame(yenibirveri)
karakterdf

  karakter sinifi karakter ismi  karakter yas
0      south park       cartman             9
1      south park         kenny            10
2         simpson         homer            50
3         simpson          bart            20
4         simpson          bart            10

In [133]:
karakterdf.pivot_table(values="karakter yas",index = ["karakter sinifi","karakter ismi"]) #bart'ın ortalamasını aldı. eğer aggfunc = np.sum yaparsak o zaman ortlama değil toplama yapar.

                               karakter yas
karakter sinifi karakter ismi
simpson         bart                     15
                homer                    50
south park      cartman                   9
                kenny                    10

In [ ]:
# dataframe.to_excel("newdf.xlsx") bu yapı ile değişmiş verileri excele yollayabiliriz.   read_excel ile okur  to_excel ile ise yollama yaparız.